import asyncio
import logging
import time

from loader import db


async def add():
    await db.sql_table_keywords()
    await db.delete_keywords()
    keyword_list = ['Мангистауский областной суд',
                    'Манғыстау облыстық соты',
                    'Актауский городской суд',
                    'Ақтау қалалық соты',
                    'Бейнеуский районный суд',
                    'Бейнеу аудандық соты',
                    'Жанаозенский городской суд',
                    'Жаңаөзен қалалық соты',
                    'Каракиянский районный суд',
                    'Қарақия аудандық соты',
                    'Мангистауский районный суд',
                    'Маңғыстау аудандық соты',
                    'Мунайлинский районный суд',
                    'Мұнайлы аудандық соты',
                    'Специализированный межрайонный административный суд',
                    'Мамандандырылған ауданаралық әкімшілік соты',
                    'Специализированный межрайонный суд по делам несовершеннолетних',
                    'Кәмелетке толмағандардың істері жөніндегі мамандандырылған ауданаралық соты',
                    'Специализированный межрайонный уголовный суд',
                    'Мамандандырылған ауданаралық қылмыстық соты',
                    'Специализированный межрайонный экономический суд',
                    'Мамандандырылған ауданаралық экономикалық соты',
                    'Специализированный следственный суд города Актау',
                    'Ақтау қаласының мамандандырылған тергеу соты',
                    'Специализированный суд административным правонарушениям города Актау',
                    'Ақтау қаласының әкімшілік құқық бұзушылықтар жөніндегі мамандандырылған соты',
                    'Специализированный суд административным правонарушениям города Жанаозен',
                    'Жаңаөзен қаласының әкімшілік құқық бұзушылықтар жөніндегі мамандандырылған соты',
                    'Суд №2 города Актау',
                    'Ақтау қаласының №2 соты',
                    'Тупкараганский районный суд',
                    'Түпқараған аудандық соты',
                    'Ержан Карабаев',
                    'Нұрсапа Примашев',
                    'Исатай Сматов',
                    'Елена Максюта',
                    'Назгул Рахметуллина',
                    'Жумаксанов Елдос',
                    'Айдос Сәдуақасов',
                    'Айжан Молбаева',
                    'Гүлажар Бақытжанова',
                    'Рахымжан Бейсенов',
                    'Мухит Мухашев',
                    'Бауыржан Шайдуллин',
                    'Иниятулла Досетов',
                    'Лариса Шамгунова',
                    'Ғабиден Орахов',
                    'Айдарбек Тленов',
                    'Гаухар Нурханова',
                    'Нуршат Утеулиева',
                    'баспасөз хатшысы',
                    'экономикалық соттың төрағасы',
                    'Бейнеу аудандық сотының төрағасы',
                    'кәмелетке толмағандардың істері жөніндегі соты',
                    'Қылмыстық істер жөніндегі сотының төрағасы',
                    'Маңғыстау облысының мамандандырылған әкімшілік сотының судьясы',
                    'Ақтау қаласының №2 сотының судьясы',
                    'Маңғыстау облыстық сотының судьясы',
                    'Маңғыстау облыстық сотының судьясы',
                    'Ақтау қалалық сотының төрағасы',
                    'Жоғарғы Соттың баспасөз хатшысы',
                    'Қазақстан Республикасы Жоғарғы Сотының жанындағы соттардың қызметін қамтамасыз ету департаменті басшысының орынбасары',
                    'Маңғыстау облыстық сотының әкімшілік істер жөніндегі сот алқасының төрағасы',
                    'Маңғыстау облыстық сотының төраға',
                    'Жоғарғы Сот судьясы',
                    'Жоғарғы Соттың судьясы']

    await db.add_keywords(keyword_list)


async def select():
    users = await db.sql_get_all_users()
    for user in users:
        print(user['login'])


loop = asyncio.get_event_loop()

loop.run_until_complete(select())
